Step 1 - Data Exploration

In [1]:
#importing dependencies
import pandas as pd

# mysql toolkit
import pymysql # this will work as adapter
from sqlalchemy import create_engine

In [2]:
df = pd.read_csv("Walmart.csv", encoding_errors = 'ignore')
df.shape

(10051, 11)

In [3]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [4]:
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [6]:
# all duplicates
df.duplicated().sum()

np.int64(51)

In [7]:
df.drop_duplicates(inplace = True)

In [8]:
df.shape

(10000, 11)

In [9]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [10]:
df.drop_duplicates

<bound method DataFrame.drop_duplicates of       invoice_id   Branch         City                category unit_price  \
0              1  WALM003  San Antonio       Health and beauty     $74.69
1              2  WALM048    Harlingen  Electronic accessories     $15.28
2              3  WALM067  Haltom City      Home and lifestyle     $46.33
3              4  WALM064      Bedford       Health and beauty     $58.22
4              5  WALM013       Irving       Sports and travel     $86.31
...          ...      ...          ...                     ...        ...
9995        9996  WALM056      Rowlett     Fashion accessories        $37
9996        9997  WALM030   Richardson      Home and lifestyle        $58
9997        9998  WALM050     Victoria     Fashion accessories        $52
9998        9999  WALM032        Tyler      Home and lifestyle        $79
9999       10000  WALM069     Rockwall     Fashion accessories        $62

      quantity      date      time payment_method  rating  profit_margin
0          7.0  05/01/19  13:08:00        Ewallet     9.1           0.48
1          5.0  08/03/19  10:29:00           Cash     9.6           0.48
2          7.0  03/03/19  13:23:00    Credit card     7.4           0.33
3          8.0  27/01/19  20:33:00        Ewallet     8.4           0.33
4          7.0  08/02/19  10:37:00        Ewallet     5.3           0.48
...        ...       ...       ...            ...     ...            ...
9995       3.0  03/08/23  10:10:00           Cash     3.0           0.33
9996       2.0  22/02/21  14:20:00           Cash     7.0           0.48
9997       3.0  15/06/23  16:00:00    Credit card     4.0           0.48
9998       2.0  25/02/21  12:25:00           Cash     7.0           0.48
9999       3.0  26/09/20   9:48:00           Cash     3.0           0.33

[10000 rows x 11 columns]>

In [11]:
# dropping all rows with missing values
df.dropna(inplace = True)
#verify
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [12]:
df.shape

(9969, 11)

In [13]:
df.dtypes

invoice_id          int64
Branch             object
City               object
category           object
unit_price         object
quantity          float64
date               object
time               object
payment_method     object
rating            float64
profit_margin     float64
dtype: object

In [14]:
# converting unit_price column to float
df['unit_price'] = df['unit_price'].str.replace('$','').astype(float)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9969 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      9969 non-null   int64
 1   Branch          9969 non-null   object
 2   City            9969 non-null   object
 3   category        9969 non-null   object
 4   unit_price      9969 non-null   float64
 5   quantity        9969 non-null   float64
 6   date            9969 non-null   object
 7   time            9969 non-null   object
 8   payment_method  9969 non-null   object
 9   rating          9969 non-null   float64
 10  profit_margin   9969 non-null   float64
dtypes: float64(4), int64(1), object(6)
memory usage: 934.6+ KB

In [16]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

In [35]:
df['total'] = df['unit_price']*df['quantity']
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [ ]:
# #mysql
# host = localhost
# port = 3306
# user = root
# password = 'password'
help(create_engine)

In [25]:
# mysql connection
engine_mysql = create_engine("mysql+pymysql://root:Sachin%40123@localhost:3306/walmart_db")
# mysql+mysqldb://scott:tiger@hostname/dbname

try:
    engine_mysql
    print("successfully connected to mysql")
except:
    print("unable to connect")

successfully connected to mysql

In [26]:
df.to_sql(name = 'walmart',con = engine_mysql, if_exists='append', index =False)

9969

In [27]:
df.shape

(9969, 11)

In [28]:
tables_df = pd.read_sql("SHOW TABLES;", engine_mysql)
print("Tables in DB:", tables_df)

Tables in DB:   Tables_in_walmart_db
0              walmart

What is the total revenue generated across all invoices?

In [30]:
query1 = """SELECT SUM(unit_price*quantity) AS total_revenue FROM walmart;"""
pd.read_sql(query1, engine_mysql)

   total_revenue
0     2419452.76


-- Which branch has the highest total profit margin?

In [32]:
query2 = """SELECT Branch, SUM(profit_margin) as total_profit_margin
FROM walmart
GROUP BY Branch
ORDER BY total_profit_margin DESC LIMIT 1; """
pd.read_sql(query2, engine_mysql)

    Branch  total_profit_margin
0  WALM009                225.6


--distict_payment_method

In [37]:
query3 = """
SELECT DISTINCT payment_method
FROM walmart"""
pd.read_sql(query3, engine_mysql)

  payment_method
0        Ewallet
1           Cash
2    Credit card


--Top 5 product by sales

In [ ]:
query4 = """SELECT category, SUM(quantity) AS total_quantity_sold
FROM walmart
GROUP BY category
ORDER BY total_quantity_sold DESC
LIMIT 5;"""

pd.read_sql(query4, engine_mysql)

                 category  total_quantity_sold
0     Fashion accessories              19306.0
1      Home and lifestyle              19220.0
2  Electronic accessories               2988.0
3      Food and beverages               1904.0
4       Sports and travel               1840.0
5       Health and beauty               1708.0


-- What is the average unit price per product category?

In [40]:
query5 = """SELECT category, AVG(unit_price) 
FROM walmart
GROUP BY category;
"""
pd.read_sql(query5, engine_mysql)

                 category  AVG(unit_price)
0       Health and beauty        54.854474
1  Electronic accessories        51.636683
2      Home and lifestyle        50.443962
3       Sports and travel        56.993253
4      Food and beverages        56.008851
5     Fashion accessories        50.124581


-- Which city has the most transactions?

In [41]:
query6 = """
SELECT city, COUNT(invoice_id) as total_invoices
FROM walmart
GROUP BY city
ORDER BY total_invoices DESC LIMIT 1;
"""
pd.read_sql(query6, engine_mysql)

      city  total_invoices
0  Weslaco             792


-- Compare average profit margin per transaction by city.

In [42]:
query7 = """SELECT city, AVG(profit_margin) avg_profit_margin 
FROM walmart
GROUP BY city
ORDER BY avg_profit_margin DESC;
"""
pd.read_sql(query7, engine_mysql)

             city  avg_profit_margin
0       Mansfield           0.570000
1   New Braunfels           0.515735
2        Victoria           0.480000
3   Grand Prairie           0.480000
4      Fort Worth           0.480000
..            ...                ...
93     Eagle Pass           0.217975
94          Alice           0.180000
95         Canyon           0.180000
96  Mineral Wells           0.180000
97    Weatherford           0.180000

[98 rows x 2 columns]


-- What are the peak sales hours of the day?

In [43]:
query8 = """SELECT HOUR(time) AS hour_of_day, SUM(unit_price * quantity) as sales
FROM walmart
GROUP BY hour_of_day
ORDER BY sales DESC;
"""
pd.read_sql(query8, engine_mysql)

    hour_of_day      sales
0            15  284033.54
1            16  269836.14
2            19  257162.12
3            17  232602.32
4            18  226145.60
5            20  218133.48
6            13  132577.48
7            14  122944.76
8            10  121512.44
9            11  121401.58
10           12  115641.30
11            7   70650.00
12            9   68590.00
13            6   61678.00
14            8   59182.00
15           21   30364.00
16           22   26472.00
17           23     526.00


-- How do sales vary by day of the week?

In [46]:
query9 = """SELECT DAYNAME(STR_TO_DATE(date, '%%d/%%m/%%y')) AS weekday, SUM(quantity * unit_price) as daily_sales 
FROM walmart
GROUP BY weekday
ORDER BY daily_sales DESC;
"""
pd.read_sql(query9, engine_mysql)

# If you must use % inside SQL queries in Python strings, escape it with another %
# single % inside python strings for sql query will gives an error because Python tries to replace %d with a number, confusing it with Python’s string formatting, not SQL’s.

     weekday  daily_sales
0   Saturday    371248.78
1    Tuesday    362435.42
2  Wednesday    349031.40
3   Thursday    348185.52
4     Sunday    342151.70
5     Friday    336207.22
6     Monday    310192.72


-- Which payment method is used most frequently?

In [ ]:
query10 = """SELECT payment_method, COUNT(*) as total_payment
FROM walmart
GROUP BY payment_method
ORDER BY total_payment DESC LIMIT 1;
"""
pd.read_sql(query10, engine_mysql)


-- What is the average customer rating per branch?

In [48]:
query11 = """SELECT branch, AVG(rating) as avg_rating
FROM walmart
GROUP BY branch;
"""
pd.read_sql(query11, engine_mysql)

     branch  avg_rating
0   WALM003    5.370430
1   WALM048    6.506329
2   WALM067    6.382192
3   WALM064    6.331250
4   WALM013    6.291228
..      ...         ...
95  WALM032    5.268235
96  WALM082    5.186022
97  WALM006    6.336620
98  WALM092    6.527451
99  WALM080    6.397333

[100 rows x 2 columns]


-- What is the most sold product category by quantity?

In [49]:
query12 = """SELECT category, SUM(quantity) total_quantity 
FROM walmart
GROUP BY category
ORDER BY total_quantity DESC LIMIT 1;
"""
pd.read_sql(query12, engine_mysql)

              category  total_quantity
0  Fashion accessories         19306.0

We can also execute queries by a making a query file in queries folder, For Example -

In [55]:
with open('queries/top5_products.sql', 'r') as file:
    query = file.read()
    # print(f"SQL Query: {query}")
pd.read_sql(query, engine_mysql)

                 category  total_quantity_sold
0     Fashion accessories              19306.0
1      Home and lifestyle              19220.0
2  Electronic accessories               2988.0
3      Food and beverages               1904.0
4       Sports and travel               1840.0
5       Health and beauty               1708.0